#+property: header-args:R :session *beo* :output-dir (concat default-directory "") :eval never-export

#+latex_class: awe-slides

#+options: title:t

#+title: Statistical dating of Old English texts
#+author: Aaron Ecay (joint work with Susan Pintzuk and Richard Zimmermann)
#+date: Apr 29, 2017

*** Elastic net: results

#+name: en-best-fit
#+begin_src R :colnames yes :exports results
  en.model$bestTune
#+end_src

#+RESULTS: en-best-fit
| alpha | lambda |
|-------+--------|
|   0.9 |   0.07 |


#+name: en-coef
#+begin_src R :colnames yes :exports results
  coefs <- round(as.matrix(coef(en.model$finalModel, s = en.model$finalModel$lambdaOpt)), 2)
  coefs <- data.frame(name = rownames(coefs), value = coefs)
  colnames(coefs) <- c("Name", "Value")
  coefs <- coefs[2:nrow(coefs),]           # Remove intercept
  coefs <- cbind(coefs[1:6,],coefs[7:12,],coefs[13:nrow(coefs),])

  coefs
#+end_src

#+latex: {\small

#+RESULTS: en-coef
| Name     | Value | Name    | Value | Name       | Value |
|----------+-------+---------+-------+------------+-------|
| DiagMC   |  0.11 | VtoC    |  0.12 | TopPPSpro  |  0.09 |
| DiagCC   |     0 | SCan    |     0 | TopObjSpro |     0 |
| DiagSC   |     0 | ScrSC   |     0 | TopPPSbj   |     0 |
| AuxVRoot |     0 | NGenSbj |     0 | TopObjSbj  |     0 |
| AuxVSC   |     0 | NGenObj |  0.41 | NegCon     |     0 |
| DiagVP   |     0 | Rel     |  0.16 | Expl       |     0 |

#+latex: }

*** Elastic net: results

#+name: en-preds
#+begin_src R :colnames yes :exports results
  res <- data.frame(text = test.texts,
             predicted = round(predict(en.model, data.test %>% select_("DiagMC", "DiagCC", "DiagSC",
                                                                 "AuxVRoot", "AuxVSC", "DiagVP",
                                                                 "VtoC", "SCan", "ScrSC", "NGenSbj",
                                                                 "NGenObj", "Rel", "TopPPSpro",
                                                                 "TopObjSpro", "TopPPSbj", "TopObjSbj",
                                                                 "NegCon", "Expl")) * sd(data.train$EstYear) +
                               mean(data.train$EstYear), 0),
             actual = data[data$Text %in% test.texts,"EstYear"])
  res$error <- res$predicted - res$actual
  res
#+end_src

#+RESULTS: en-preds
| text                               | predicted | actual | error |
|------------------------------------+-----------+--------+-------|
| 1.07 Orosius                       |       939 |    899 |    40 |
| 1.06 Augustine Soliloquy           |       961 |    898 |    63 |
| 2.01 Benedictine Rule              |       956 |    965 |    -9 |
| 3.04 Aelfric Supplemental Homilies |       994 |   1000 |    -6 |
| 3.09 Wulfstan Institutes of Polity |      1016 |   1008 |     8 |
| 3.13 Byrhtferth Manual             |       983 |   1011 |   -28 |

#+name: en-rmse
#+begin_src R :exports none
  sqrt(mean(res$error^2))
#+end_src

#+RESULTS: en-rmse
: 33


